#### f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오
- 결측치는 f1의 데이터 중 내림차순 정렬 후 10번째 값으로 채움
- 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함
- 최종 결과값은 절대값으로 출력

데이터셋 : basic1.csv

In [28]:
import os
from os.path import join

import pandas as pd

In [35]:
file_NM = join('data', 'basic1.csv')
df = pd.read_csv(file_NM)
df.head(3)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [36]:
df_age = df['f1'].sort_values(ascending = False) #내림차순
df_age.iloc[9] #10번째값

df['f1'] = df['f1'].fillna(df_age.iloc[9])

In [37]:
result1 = df['f1'].median()
result1

77.5

In [39]:
df = df.drop_duplicates(subset = ['age'])
df

      id   age city    f1  f2   f3    f4         f5
0   id01   2.0   서울  88.0   0  NaN  ENFJ  91.297791
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3   id04  75.0   서울  88.0   2  NaN  INFP  52.667078
4   id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
..   ...   ...  ...   ...  ..  ...   ...        ...
90  id91   6.0   경기  72.0   0  NaN  INTP   9.796378
92  id93  21.8   경기  57.0   0  NaN  ISFP  73.586397
93  id94  84.0   경기  88.0   1  NaN  ESTJ  90.496999
97  id98  39.0   경기  58.0   2  NaN  INFP  98.429899
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034

[71 rows x 8 columns]

In [40]:
result2 = df['f1'].median()
result2

77.0

In [42]:
print(abs(result1 - result2))

0.5